&НаКлиенте
Процедура ВидимостьЭлементовФормы()
	
	Элементы.ГруппаРекБВ.Видимость = (Объект.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Выписка"));
	Элементы.ГруппаРекОпер.Видимость = (Объект.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Операция"));
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьРеквизитыФормы()
	
	Если Объект.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Выписка") Тогда
		Массив = СтрРазделить(Объект.КудаВыгружать, ",",Истина);
		Если Массив.Количество() > 4 Тогда
			ДвижениеДС = СтрЗаменить(Массив[0], """", "");
			КоррСчет =   СтрЗаменить(Массив[1], """", "");
			Субконто1 =  СтрЗаменить(Массив[2], """", "");
			Субконто2 =  СтрЗаменить(Массив[3], """", "");
			Назначение = СтрЗаменить(Массив[4], """", "");
		КонецЕсли;
	ИначеЕсли Объект.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Операция") Тогда
		Массив = СтрРазделить(Объект.КудаВыгружать, ",",Истина);
		Если Массив.Количество() > 6 Тогда
			СчДт = СтрЗаменить(Массив[0], """", "");
			СубконтоДт1 =   СтрЗаменить(Массив[1], """", "");
			СубконтоДт2 =  СтрЗаменить(Массив[2], """", "");
			СчКт =  СтрЗаменить(Массив[3], """", "");
			СубконтоКт1 =   СтрЗаменить(Массив[4], """", "");
			СубконтоКт2 =  СтрЗаменить(Массив[5], """", "");		
			Содержание = СтрЗаменить(Массив[6], """", "");	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура РекБВПриИзменении(Элемент)
	
	Объект.КудаВыгружать = ""+СокрЛП(ДвижениеДС)+","+СокрЛП(КоррСчет)+","+СокрЛП(Субконто1)+","+СокрЛП(Субконто2)+","+СокрЛП(Назначение)+",";	
	
КонецПроцедуры

&НаКлиенте
Процедура КудаВыгружатьПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьЭлементовФормы();
	ЗаполнитьРеквизитыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РекОперПриИзменении(Элемент)
	
	Объект.КудаВыгружать = ""+СокрЛП(СчДт)+","+СокрЛП(СубконтоДт1)+","+СокрЛП(СубконтоДт2)+","+СокрЛП(СчКт)+","+СокрЛП(СубконтоКт1)+","+СокрЛП(СубконтоКт2)+","+СокрЛП(Содержание)+",";	
	
КонецПроцедуры
