#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОстатками50и51Из8() Экспорт
	
	
	тз = Остатки.Выгрузить();	
	тз = Документы.ЗагрузкаОстатков.ЗаполнитьОстатками50и51Из8(тз, Дата, Ссылка);
	тз.Свернуть("Счет, Организация, Счет7", "СуммаОстатка");
	Остатки.Загрузить(тз);
		
КонецПроцедуры	

Процедура ЗаполнитьОстатками50и51Из7() Экспорт
	
	
КонецПроцедуры

#КонецОбласти
	
#Область ОбработчикиСобытий	
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//ЗначенияДляЗаполнения = Новый Структура("Ответственный",
	//		"Объект.Ответственный");
	//ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ЗначенияДляЗаполнения);
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
	
	
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Если НЕ ОстаткиБазыМММ Тогда
		// регистр ОстаткиДС8
		Движения.ОстаткиДС8.Записывать = Истина;
		Для Каждого ТекСтрокаОстатки Из Остатки Цикл
			Движение = Движения.ОстаткиДС8.Добавить();
			Движение.Период = НачалоМесяца(Дата);
			Движение.Организация = ТекСтрокаОстатки.Организация;
			Движение.Счет = ТекСтрокаОстатки.Счет;
			Движение.Аналитика = ТекСтрокаОстатки.Аналитика;
			Движение.Сумма = ТекСтрокаОстатки.СуммаОстатка;
		КонецЦикла;
		
	Иначе	

		// регистр ОстаткиДС7
		Движения.ОстаткиДС7.Записывать = Истина;
		Для Каждого ТекСтрокаОстатки Из Остатки Цикл
			Движение = Движения.ОстаткиДС7.Добавить();
			Движение.Период = НачалоМесяца(Дата);
			Движение.Организация = ТекСтрокаОстатки.Счет7;
			Движение.Счет = ТекСтрокаОстатки.Счет;
			Движение.Аналитика = ТекСтрокаОстатки.Аналитика;
			Движение.Сумма = ТекСтрокаОстатки.СуммаОстатка;
		КонецЦикла;
	КонецЕсли;	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли