#Область ПрограммныйИнтерфейс
Функция ПодключитьсяКБазеМММКлиент(Пользователь = "Robot", Пароль = "bot") Экспорт	
	
	ПутьКБазе = мммСервер.ЗначениеКонстанты("ПутьКБазеМММ");
	Если ПустаяСтрока(ПутьКБазе) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		База = Новый COMОбъект("v77.Application");
		//База = Новый COMОбъект("V1СEnterprise.Application");
	Исключение
		#Если Клиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		#КонецЕсли
		Возврат Неопределено;
	КонецПопытки;
	
	СтрокаПодключения = "/D""" + СокрЛП(ПутьКБазе) + """ /N""" + СокрЛП(Пользователь) + """ /P""" + СокрЛП(Пароль) + """";
	
	// Попытка 1
	РезультатПодключения = База.Initialize(База.RMTrade, СтрокаПодключения, "NO_SPLASH_SHOW");
	Если РезультатПодключения Тогда
		Возврат База;
	КонецЕсли;
	
	// Попытка 2
	РезультатПодключения = База.Initialize(База.RMTrade, СтрокаПодключения, "NO_SPLASH_SHOW");
	Если РезультатПодключения Тогда
		Возврат База;
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции		
#КонецОбласти