	//ПутьКБазе					= КаталогБазы;
	//Пользователь				= "Obmen";
	//Пароль						= "7532159";
	//МонопольныйРежимOLE 		= ""; // " /m";
	//ЗапускБезЗаставки 			= 1;
	//
	//База 						= Новый COMОбъект("v77.Application");
	//
	//СтрокаПодключения 			= "/D""" + СокрЛП(ПутьКБазе) + """ /N""" + СокрЛП(Пользователь) + """ /P""" + СокрЛП(Пароль) + """";
	//
	//РезультатПодключения		= База.Initialize(База.RMTrade,СтрокаПодключения,?(ЗапускБезЗаставки = 1, "NO_SPLASH_SHOW", ""));	
	
Функция ПодключитьсяКБазеМММКлиент(Пользователь = "Robot", Пароль = "bot") Экспорт	
	
	ПутьКБазе = мммСервер.ЗначениеКонстанты("ПутьКБазеМММ");
	Если ПустаяСтрока(ПутьКБазе) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		База = Новый COMОбъект("v77.Application");
		//База = Новый COMОбъект("V1СEnterprise.Application");
	Исключение
		#Если Клиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		#КонецЕсли
		Возврат Неопределено;
	КонецПопытки;
	
	СтрокаПодключения = "/D""" + СокрЛП(ПутьКБазе) + """ /N""" + СокрЛП(Пользователь) + """ /P""" + СокрЛП(Пароль) + """";
	
	// Попітка 1
	РезультатПодключения = База.Initialize(База.RMTrade, СтрокаПодключения, "NO_SPLASH_SHOW");
	Если РезультатПодключения Тогда
		Возврат База;
	КонецЕсли;
	
	// Попітка 2
	РезультатПодключения = База.Initialize(База.RMTrade, СтрокаПодключения, "NO_SPLASH_SHOW");
	Если РезультатПодключения Тогда
		Возврат База;
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции		