#Область ПрограммныйИнтерфейс

Функция ИспользоватьМодульРеализацияКасса50(Организация) Экспорт
	
	Если Организация.ИНН = "7807244449" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ИспользоватьМодульРеализацияБанк51(Организация) Экспорт
	
	Если Организация.ИНН = "7807244449" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ИспользоватьПеребросЯрисКонтракт(Организация) Экспорт
	
	Если Организация.ИНН = "7807244449" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоФирмаКонтракт(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		Если Организация.ИНН = "7807244449" Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если Организация = "7807244449" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоФирмаМагнат(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		Если Организация.ИНН = "7807244583" Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если Организация = "7807244583" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоФирмаТерминал(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		Если Организация.ИНН = "7817111857" Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если Организация = "7817111857" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоФирмаВентор(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		Если Организация.ИНН = "7817120139" Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если Организация = "7817120139" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоФирмаПлутон(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		Если Организация.ИНН = "7817116982" Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если Организация = "7817116982" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоОрганизации_NMU_Juli(Организация) Экспорт
	
	Если Организация.ИНН = "7813641028"			// Прометей 
		ИЛИ Организация.ИНН = "7810784317"		// Нимфа
		ИЛИ Организация.ИНН = "7805756089"		// Грес
		ИЛИ Организация.ИНН = "7810775827"		// Клён 
		ИЛИ Организация.ИНН = "7813639340"		// Эллада
		ИЛИ Организация.ИНН = "7813640338"      // Троя
		ИЛИ Организация.ИНН = "7840507769"      // Ариэль
		ИЛИ Организация.ИНН = "7810782870"		// Радон 
		ИЛИ Организация.ИНН = "7807235860"  	// Неоп
		ИЛИ Организация.ИНН = "7811435510" 		// Софт
		ИЛИ Организация.ИНН = "780422436074"    // КФХ (Курбединов Э. Э. ИП) 13 сервер
		ИЛИ Организация.ИНН = "7802882744"    	// ТрейдФуд
		ИЛИ Организация.ИНН = "7802709764"   	// Кравец
		ИЛИ Организация.ИНН = "7807241173" Тогда// Компас
			
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

Функция ЭтоФирмыЗП(Организация) Экспорт
	
	Если Организация.ИНН = "7807229867"			// АВРОРА ООО 
		ИЛИ Организация.ИНН = "7839118800"		// ВОСХОД ООО
		ИЛИ Организация.ИНН = "7813612732"		// ИНДАСТРИ ООО
		ИЛИ Организация.ИНН = "7838080504"		// ОЛИМП ООО 
		ИЛИ Организация.ИНН = "7810691630"		// ООО "Сервис"
		ИЛИ Организация.ИНН = "7813612250"      // ООО Динамика
		ИЛИ Организация.ИНН = "7807134527"      // ООО "Гермес"
		ИЛИ Организация.ИНН = "7802692366"      // ООО "МОНОЛИТПРОЕКТГРАЖДАНСТРОЙ"
		ИЛИ Организация.ИНН = "7807228937"      // ООО "ЦИКЛОН"
		ИЛИ Организация.ИНН = "7807202784" Тогда// СИРИУС ООО
			
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

Функция ЭтоЖасмин(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("Строка") Тогда	
		Если Организация = "7807227468"	Тогда
			Возврат Истина;
		КонецЕсли;	
	Иначе	
		Если Организация.ИНН = "7807227468"	Тогда	// Жасмин ООО 		
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;	
	
КонецФункции     

Функция ЭтоВулкан(Организация) Экспорт
	
	Если Организация.ИНН = "7807217100"	Тогда	// Вулкан ООО 
			
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции


Функция ЭтоБайкалЯрисПосейдон(Организация) Экспорт
	
	Если Организация.ИНН = "7807244512"	ИЛИ Организация.ИНН = "7807244431" ИЛИ Организация.ИНН = "7807236582" Тогда	//  
			
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

Функция ЭтоБоткоЗевс(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("Строка") Тогда	
		Если Организация = "7807183186"	ИЛИ Организация = "7807191719"	Тогда
			Возврат Истина;
		КонецЕсли;	
	Иначе	
		Если Организация.ИНН = "7807183186"	ИЛИ Организация.ИНН = "7807191719"  Тогда	//  	
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;	
	
КонецФункции

Функция Счет50(Организация) Экспорт
	
	Если ТипЗнч(Организация) = Тип("Строка") Тогда
		
		Организация = Новый Структура("ИНН", Организация);
		
	КонецЕсли;	
	
	Если Организация.ИНН = "7807244583" ИЛИ Организация.ИНН = "7807244449" Тогда    // Магнат, Контракт
		Возврат "50.1";
	ИначеЕсли Организация.ИНН = "7807183186" Тогда                                  // Ботко
		Возврат "50.11";
	ИначеЕсли Организация.ИНН = "7807191719" Тогда                                  // Зевс
		Возврат "50.22";
	ИначеЕсли Организация.ИНН = "7807227468" Тогда                                  // Жасмин
		Возврат "50.33";
																					// Терминал 50.1
																					// Плутон   50.1
																					// Вентор	50.1
	Иначе
		Возврат "50.1";
	КонецЕсли;	
	
КонецФункции

//		Аналитика76.Добавить("КОНТРАКТ");         
//		Аналитика76.Добавить("МАГНАТ");        // добавить терминал, плутон, вентор
//		Аналитика76.Добавить("ТЕРМИНАЛ");
//		Аналитика76.Добавить("ВЕНТОР");
//		Аналитика76.Добавить("ПЛУТОН");
//
Функция ЭтоФирмыУниверсама(ИНН) Экспорт
	
	Возврат ЭтоФирмаКонтракт(ИНН) 
		ИЛИ ЭтоФирмаМагнат(ИНН) 
		ИЛИ ЭтоФирмаТерминал(ИНН) 
		ИЛИ ЭтоФирмаВентор(ИНН) 
		ИЛИ ЭтоФирмаПлутон(ИНН);
	
КонецФункции	

Функция ЭтоКассоваяФирма(Организация) Экспорт
	
	Возврат ЭтоЖасмин(Организация) 
		ИЛИ ЭтоБоткоЗевс(Организация) 
		ИЛИ ЭтоФирмаМагнат(Организация) 
		ИЛИ ЭтоФирмаКонтракт(Организация) 
		ИЛИ ЭтоФирмаТерминал(Организация) 
		ИЛИ ЭтоФирмаПлутон(Организация) 
		ИЛИ ЭтоФирмаВентор(Организация);
	
КонецФункции	
#КонецОбласти

Процедура Пауза(секунд) Экспорт
	 ОбменДаннымиСервер.Пауза(секунд)
КонецПроцедуры	