Функция СоздатьСчет7(стрИмя) Экспорт
	
	Если ПустаяСтрока(стрИмя) Тогда
		Возврат Справочники.Счета7.ПустаяСсылка();
	КонецЕсли;	
	
	спрСсылка = Справочники.Счета7.НайтиПоНаименованию(СокрЛП(стрИмя), Истина);
	Если ЗначениеЗаполнено(спрСсылка) Тогда
		Возврат спрСсылка;
	КонецЕсли;
	
	Об = Справочники.Счета7.СоздатьЭлемент();
	Об.Наименование = СокрЛП(стрИмя);
	Попытка
		Об.Записать();
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать счет7 "+стрИмя);
		Возврат Справочники.Счета7.ПустаяСсылка();
	КонецПопытки;
	
	Возврат Об.Ссылка;
	
КонецФункции	