&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПодключитьОбработчикОжидания("ВыполнитьОбмен7", 1800, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаОстатковНажатие(Элемент)
	
	ОткрытьФорму("Документ.ЗагрузкаОстатков.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииНажатие(Элемент)
	
	ОткрытьФорму("Справочник.Организации.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СверкаОстатков50516062Нажатие(Элемент)
	
	ОткрытьФорму("Отчет.СверкаОстатковДенежныхСредств.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНажатие(Элемент)
	
	ОткрытьФорму("Обработка.МММСервис.Форма.ОтчетЗатраты");
	
КонецПроцедуры

&НаКлиенте
Процедура Обототы50516062Нажатие(Элемент)
	
	ОткрытьФорму("Обработка.МММСервис.Форма.ВыгрузкаОборотов50516062ВМММ");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетВНДНажатие(Элемент)
	
	ОткрытьФорму("Отчет.ВНД.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиОброты50516062Нажатие(Элемент)
	
	ОткрытьФорму("Отчет.ОстаткиИОбороты50516062.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен7() Экспорт
	Попытка
		мммОтчетОстаткиКлиент.ЗагрузитОстаткиИОбороты7(НачалоМесяца(НачалоМесяца(ТекущаяДата())-1));
		мммОтчетОстаткиКлиент.ЗагрузитОстаткиИОбороты7(НачалоМесяца(ТекущаяДата()));
	Исключение
	КонецПопытки;	
КонецПроцедуры	