#Область ПрограммныйИнтерфейс
Процедура ОтправитьДанныев7(Данные, ЭтаФорма, Элементы) Экспорт
	
	//ТабДок = Новый ТабличныйДокумент;
	//Макет = ЗатратыСервер.ПолучитьМакетНаСервере(ТабДок, ЭтаФорма.Объект.ПериодРегистрации);
	
	БазаОле = мммКлиент.ПодключитьсяКБазеМММКлиент();
	Если НЕ БазаОле = Неопределено Тогда
		
		ТекНомер = 0;
		Для Каждого Эл Из Данные Цикл
			
			Запись = Неопределено;
			Если ТипЗнч(Эл) = Тип("РегистрСведенийКлючЗаписи.ДанныеКВыгрузкеВ7") Тогда
				Запись = ЗатратыСервер.ПолучитьЗаписьПоКлючу(Эл);
			Иначе
				Запись = ЗатратыКлиентСервер.СтруктураДанных(Эл);
			КонецЕсли;	
			
			Состояние(Запись.Группа, 100 * (ТекНомер / Данные.Количество()), Запись.Счет + ", " + Запись.КорСчет + ", " + Запись.ВидОперации, БиблиотекаКартинок.ОбменДанными32);
			ОбработкаПрерыванияПользователя();
			Элементы.Очередь.Обновить();
			
			Если Запись.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Выписка") Тогда
				ОтправитьВыписку(БазаОле, Запись, ЭтаФорма.Затирать);
			ИначеЕсли Запись.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Операция") Тогда
				ОтправитьОперацию(БазаОле, Запись,, ЭтаФорма.Затирать);
			ИначеЕсли Запись.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.ПоступлениеМатериалов") Тогда
				ОтправитьПоступлениеМатериалов(БазаОле, Запись);
			ИначеЕсли Запись.Документ = ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.ПоступлениеТоваров") Тогда
				ОтправитьПоступлениеТоваров(БазаОле, Запись);
			КонецЕсли;
			
			ТекНомер = ТекНомер + 1;
		КонецЦикла;
	КонецЕсли;	
	
	//ТабДок.Показать();

КонецПроцедуры	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ОтправитьВыписку(БазаОле, Данные, Затирать)
	
	ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_ВПроцессе());
	//ЗатратыСервер.Вывести(ТабДок, Макет, "СтрДокумент", Новый Структура("Документ", Данные.Документ));
	
	Док = БазаОле.CreateObject("Документ");
	ДокВыписка = БазаОле.CreateObject("Документ.Выписка");
	Док.UseJournal("Банк");
	
	Если Док.SelectByValue(Данные.Период, КонецМесяца(Данные.Период), "ИНН", Данные.ИНН) Тогда
		
		Пока Док.GetDocument() = 1 Цикл
			Попытка
				ДокВыписка.FindDocument(Док.ТекущийДокумент());
			Исключение
				мммОтчетЗатратыСерверПереопределяемый.Пауза(1);
				Док.GetDocument();
			КонецПопытки;	
			Попытка
				ДокВыписка.FindDocument(Док.ТекущийДокумент());
			Исключение
				мммОтчетЗатратыСерверПереопределяемый.Пауза(5);
				Док.GetDocument();
			КонецПопытки;			
			Если ДокВыписка.FindDocument(Док.ТекущийДокумент()) = 1 Тогда
				
				СтрокаНайдена = Ложь;
				ДокВыписка.SelectLines();
				Пока ДокВыписка.GetLine() Цикл
					ОбработкаПрерыванияПользователя();
					СтрокаНайдена = Ложь;
					ТекСтрока = СтруктураСтрокиВыписки(ДокВыписка);
					ДопПараметры = Неопределено;
					ДелатьЗеркальнуюОперацию = Ложь;
					Если ЗатратыСервер.ВыпискаПроверитьСтроку(Данные, ТекСтрока, ДопПараметры, ДелатьЗеркальнуюОперацию) Тогда
						
						СтрокаНайдена = Истина;
						Если Данные.СуммаОперации > 0 Тогда 
							Если (ДокВыписка.Приход > 0) и (Данные.СуммаОперации <>  ДокВыписка.Приход) Тогда
								Сообщить(
									"Выписка " + СокрЛП(ДокВыписка.НомерДок) + " от " + СокрЛП(ДокВыписка.ДатаДок) + " по строке " + ДокВыписка.НомерСтроки +
									", Сумма= " + ДокВыписка.Приход + " отличается от загружаемой суммы= " + Данные.СуммаОперации + 
									", Вид движения: " + ДокВыписка.ВидДвижения.Наименование + ", Счет: " + Данные.Счет +  ", КорСчет: " + ДокВыписка.КоррСчет.Код	
									, СтатусСообщения.Внимание
								);

							КонецЕсли;
							ДокВыписка.SetAttrib("Приход", ?(ДокВыписка.Приход > 0, ?(Затирать, Данные.СуммаОперации, ДокВыписка.Приход + Данные.СуммаОперации), Данные.СуммаОперации));
			
						Иначе
							Если (ДокВыписка.Расход > 0) и (Данные.СуммаОперации <>  ДокВыписка.Расход)  Тогда
								Сообщить(
									"Выписка " + СокрЛП(ДокВыписка.НомерДок) + " от " + СокрЛП(ДокВыписка.ДатаДок) + " по строке " + ДокВыписка.НомерСтроки +
									", Сумма= " + ДокВыписка.Расход + " отличается от загружаемой суммы= " + Данные.СуммаОперации + 
									", Вид движения: " + ДокВыписка.ВидДвижения.Наименование + ", Счет: " + Данные.Счет + ", КорСчет: " + ДокВыписка.КоррСчет.Код
									, СтатусСообщения.Внимание
								);
								
							КонецЕсли;
							ДокВыписка.SetAttrib("Расход", ?(ДокВыписка.Расход > 0, ?(Затирать, -1*Данные.СуммаОперации, ДокВыписка.Расход + ((-1)*Данные.СуммаОперации)), -1*Данные.СуммаОперации));
							
						КонецЕсли;
						
						ЗаписатьДок(ДокВыписка, Данные, ДопПараметры);
						Если ДелатьЗеркальнуюОперацию Тогда
							стОперации = Новый Структура;
							стОперации.Вставить("СчДт", ?(Данные.СуммаОперации > 0, "51", ТекСтрока.КоррСчет));
							стОперации.Вставить("СчКт", ?(Данные.СуммаОперации > 0, ТекСтрока.КоррСчет, "51"));
							стОперации.Вставить("Субконто1", Данные.Группа);
							стОперации.Вставить("СуммаОперации", Данные.СуммаОперации);
							стОперации.Вставить("ВидОперации", Данные.ВидОперации);
							стОперации.Вставить("ИНН", Данные.ИНН);
							стОперации.Вставить("Документ", ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Операция"));
							стОперации.Вставить("Группа", Данные.Группа);
							стОперации.Вставить("Период", Данные.Период);
							стОперации.Вставить("Организация", Данные.Организация);	
							
							Ответ = ОтправитьЗеркальнуюОперацию(БазаОле, стОперации,,Затирать); 
							Если Ответ.Успешно Тогда
								ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Успешно(),, Ответ.Док);
							Иначе
								ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), Ответ.СтрокаОшибки,,);
							КонецЕсли;								
						КонецЕсли;	
						// зеркальная проводка в операции когда корр счет не 50, а другой (76), но при этом в выписке сделали проводку на 50.1
						
						
						// 50 делаем проводку в Операции
						//Если СтрНайти(ТекСтрока.КоррСчет, "50.") > 0 Тогда							
						//	стОперации = Новый Структура;
						//	стОперации.Вставить("СчДт", ?(Данные.СуммаОперации > 0, "51", мммОтчетЗатратыСерверПереопределяемый.Счет50(Данные.Организация)));
						//	стОперации.Вставить("СчКт", ?(Данные.СуммаОперации > 0, мммОтчетЗатратыСерверПереопределяемый.Счет50(Данные.Организация), "51"));
						//	стОперации.Вставить("Субконто1", Данные.Группа);
						//	стОперации.Вставить("СуммаОперации", Данные.СуммаОперации);
						//	стОперации.Вставить("ВидОперации", Данные.ВидОперации);
						//	стОперации.Вставить("ИНН", Данные.ИНН);
						//	стОперации.Вставить("Документ", ПредопределенноеЗначение("Перечисление.ВидыВыгружаемыхДокументов.Операция"));
						//	стОперации.Вставить("Группа", Данные.Группа);
						//	стОперации.Вставить("Период", Данные.Период);
						//	стОперации.Вставить("Организация", Данные.Организация);

						//	Ответ = ОтправитьЗеркальнуюОперацию(БазаОле, стОперации,,Затирать); 
						//	Если Ответ.Успешно Тогда
						//		ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Успешно(),, Ответ.Док);
						//	Иначе
						//		ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), Ответ.СтрокаОшибки,,);
						//	КонецЕсли;
						//КонецЕсли;	
						
						Прервать;	
							
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ СтрокаНайдена Тогда
			ТекстСообщения = "Не найдена строка в документе " + Данные.ИНН + ", " + Данные.Период + ", " + Данные.Организация + 
				Данные.Документ + ", Счет: " + Данные.Счет + ", Кор. счет: " + Данные.КорСчет + ", "+ 
				СокрЛП(Данные.ВидОперации) + ", " + Данные.Группа;
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное
			);
			ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры	

Функция ОтправитьЗеркальнуюОперацию(БазаОле, Данные, ИННПоиска = "", Затирать = Ложь)
	
	//Если мммОтчетЗатратыСерверПереопределяемый.Счет50(Данные.Организация) = "50.1" Тогда
	//	Возврат Новый Структура("Успешно,СтрокаОшибки,Док", Истина, "касса 50.1","");
	//КонецЕсли;	
	
	РекурсивныйВызов = НЕ ПустаяСтрока(ИННПоиска);
	Если ПустаяСтрока(ИННПоиска) Тогда
		Если Данные.СчДт = "50.33" ИЛИ Данные.СчКт = "50.33" Тогда
			ИННПоиска = "7807227468";
		ИначеЕсли Данные.СчДт = "50.11" ИЛИ Данные.СчКт = "50.11" Тогда
			ИННПоиска = "7807183186";
		ИначеЕсли Данные.СчДт = "50.22" ИЛИ Данные.СчКт = "50.22" Тогда
			ИННПоиска = "7807191719";	
		Иначе
			ИННПоиска = Данные.ИНН;//?(Данные.Группа = "Перс", "Перс", ?(Данные.Группа = "П20", "П20", Данные.ИНН));
		КонецЕсли;	
	КонецЕсли;	
	ПроводкаНайдена = Ложь;	
	
	ДокОперация = БазаОле.CreateObject("Операция");
	Если ДокОперация.ВыбратьПоЗначению(Данные.Период, КонецМесяца(Данные.Период), "ИНН", ИННПоиска) Тогда
		
		ДокОперация.ВыбратьПроводки();
		ПроводкаНайдена = Ложь;
		Пока ДокОперация.ПолучитьПроводку() Цикл
			ОбработкаПрерыванияПользователя();
			
			ТекСтрока = СтруктураСтрокиОперации(ДокОперация);
			СуммаПоМодулю = Истина;
			Если ТекСтрока.СчДт = Данные.СчДт И ТекСтрока.СчКт = Данные.СчКт 
				И ((ТекСтрока.СубконтоДт1 = Данные.Субконто1 И Данные.СуммаОперации > 0)
				ИЛИ (ТекСтрока.СубконтоКт1 = Данные.Субконто1 И Данные.СуммаОперации < 0)) Тогда
				ПроводкаНайдена = Истина;
				Если (ТекСтрока.Сумма <> 0) и (Данные.СуммаОперации <>  ТекСтрока.Сумма)  Тогда
					Сообщить(
						"Операция " + СокрЛП(ДокОперация.Document.НомерДок) + " от " + СокрЛП(ДокОперация.OperDate) + " по строке " + ДокОперация.DocLineNum() +
						", Сумма= " + ТекСтрока.Сумма + " отличается от загружаемой суммы= " + Данные.СуммаОперации + 
						", Содержание: " + ТекСтрока.СодержаниеПроводки + ", Счет Дт: " + ТекСтрока.СчДт +  ", Счет Кт: " + ТекСтрока.СчКт	
						, СтатусСообщения.Внимание
					);
					
				КонецЕсли;
				ДокОперация.SetAttrib("Сумма", 
					?((Данные.СуммаОперации < 0) И (СуммаПоМодулю), ?(Затирать, -1* Данные.СуммаОперации, -1* Данные.СуммаОперации + ?(ЗначениеЗаполнено(ТекСтрока.Сумма), ТекСтрока.Сумма, 0)),  	 
																 	?(Затирать, 	Данные.СуммаОперации, 	  Данные.СуммаОперации + ?(ЗначениеЗаполнено(ТекСтрока.Сумма), ТекСтрока.Сумма, 0))
					)
				);
				
				Попытка
					ДокОперация.Write();
					Сообщить("Записана сумма в Операцию " + ДокОперация.Document.НомерДок + " от " + ДокОперация.OperDate + ", номер строки " + ДокОперация.EntryNumber());
					//ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Успешно());
					Возврат Новый Структура("Успешно,СтрокаОшибки,Док", Истина,"", "Записана сумма в Операцию " + ДокОперация.Document.НомерДок + " от " + ДокОперация.OperDate + ", номер строки " + ДокОперация.EntryNumber()); 
				Исключение
					Сообщить(ОписаниеОшибки());
					//ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ОписаниеОшибки());	
					Возврат Новый Структура("Успешно,СтрокаОшибки,Док", Ложь,ОписаниеОшибки(),"");
				КонецПопытки;
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
		Если НЕ ПроводкаНайдена Тогда
			
			Если РекурсивныйВызов Тогда
				ТекстСообщения = "Не найдена строка в документе " + Данные.ИНН + ", " + Данные.Период + ", " + Данные.Организация + 
					Данные.Документ + ", Счет: " + Данные.СчДт + ", Кор. счет: " + Данные.СчКт + ", "+ 
					СокрЛП(Данные.ВидОперации) + ", " + Данные.Группа;
				Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное
				);
				//ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);
				Возврат Новый Структура("Успешно,СтрокаОшибки,Док", Ложь, ТекстСообщения,"");
			Иначе
				Возврат ОтправитьЗеркальнуюОперацию(БазаОле, Данные, "5050505050", Затирать);	
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат ОтправитьЗеркальнуюОперацию(БазаОле, Данные, "5050505050", Затирать);
		Если РекурсивныйВызов Тогда
			ТекстСообщения = "Не найдена операция для организации " + Данные.Организация + ", ИНН: " + Данные.ИНН + ", группа: " + ?(Данные.Группа = "Перс", "Перс", ?(Данные.Группа = "П20", "П20", Данные.ИНН));
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
			//ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);
			Возврат Новый Структура("Успешно,СтрокаОшибки,Док", Ложь, ТекстСообщения,"");
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции	


Процедура ОтправитьОперацию(БазаОле, Данные, ИННПоиска = "", Затирать = Ложь)

	//Если Данные.КорСчет = "51" Тогда
	//	Возврат;
	//КонецЕсли;	
	// грузим с управленца для основной кассы
	
	// орперации только Жсмн, Бтк, Звс - остальное с управленца
	Если мммОтчетЗатратыСерверПереопределяемый.ЭтоБоткоЗевс(Данные.Организация) ИЛИ мммОтчетЗатратыСерверПереопределяемый.ЭтоЖасмин(Данные.Организация) Тогда
	Иначе
		Возврат;
	КонецЕсли;	
	
	
	Если мммОтчетЗатратыСерверПереопределяемый.Счет50(Данные.Организация) = "50.1" Тогда
		Возврат;
	КонецЕсли;	
	
	РекурсивныйВызов = НЕ ПустаяСтрока(ИННПоиска);
	Если ПустаяСтрока(ИННПоиска) Тогда
		ИННПоиска = Данные.ИНН;//?(Данные.Группа = "Перс", "Перс", ?(Данные.Группа = "П20", "П20", Данные.ИНН));
	КонецЕсли;	
	ПроводкаНайдена = Ложь;
	ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_ВПроцессе());
	
	ДокОперация = БазаОле.CreateObject("Операция");
	Если ДокОперация.ВыбратьПоЗначению(Данные.Период, КонецМесяца(Данные.Период), "ИНН", ИННПоиска) Тогда
		
		ДокОперация.ВыбратьПроводки();
		ПроводкаНайдена = Ложь;
		Пока ДокОперация.ПолучитьПроводку() Цикл
			ОбработкаПрерыванияПользователя();
			
			ТекСтрока = СтруктураСтрокиОперации(ДокОперация);
			СуммаПоМодулю = Ложь;
			ДопПараметр = Неопределено;
			Если ЗатратыСервер.ОперацияПроверитьСтроку(Данные, ТекСтрока, СуммаПоМодулю, ДопПараметр) Тогда
				ПроводкаНайдена = Истина;
				
				Если НЕ ДопПараметр = Неопределено Тогда
					ЗатратыСервер.УстановитьСтатус(Данные, 
						?(ДопПараметр.Возврат, ЗатратыКлиентСервер.СтатусОтправки_Успешно(), ЗатратыКлиентСервер.СтатусОтправки_Ошибка()),
						?(ДопПараметр.Возврат, "", ДопПараметр.Описание),
						?(ДопПараметр.Возврат, ДопПараметр.Описание, "")
					);
					Прервать;
				КонецЕсли;	
				
				Если (ТекСтрока.Сумма <> 0) и (Данные.СуммаОперации <>  ТекСтрока.Сумма)  Тогда
					Сообщить(
						"Выписка " + СокрЛП(ДокОперация.Document.НомерДок) + " от " + СокрЛП(ДокОперация.OperDate) + " по строке " + ДокОперация.EntryNumber() +
						", Сумма= " + ТекСтрока.Сумма + " отличается от загружаемой суммы= " + Данные.СуммаОперации + 
						", Содержание: " + ТекСтрока.СодержаниеПроводки + ", Счет Дт: " + ТекСтрока.СчДт +  ", Счет Кт: " + ТекСтрока.СчКт	
						, СтатусСообщения.Внимание
					);
					
				КонецЕсли;
				ДокОперация.SetAttrib("Сумма", 
					?((Данные.СуммаОперации < 0) И (СуммаПоМодулю), ?(Затирать, -1* Данные.СуммаОперации, -1* 	Данные.СуммаОперации + 	?(ЗначениеЗаполнено(ТекСтрока.Сумма), ТекСтрока.Сумма, 0)),  	 
																 	?(Затирать, 	Данные.СуммаОперации, 		Данные.СуммаОперации + 	?(ЗначениеЗаполнено(ТекСтрока.Сумма), ТекСтрока.Сумма, 0))
					)
				);
				
				Попытка
					ДокОперация.Write();
					Сообщить("Записана сумма в Операцию " + ДокОперация.Document.НомерДок + " от " + ДокОперация.OperDate + ", номер строки " + ДокОперация.EntryNumber());
					ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Успешно(),, "Записана сумма в Операцию " + ДокОперация.Document.НомерДок + " от " + ДокОперация.OperDate + ", номер строки " + ДокОперация.EntryNumber());
				Исключение
					Сообщить(ОписаниеОшибки());
					ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ОписаниеОшибки());	
				КонецПопытки;
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
		Если НЕ ПроводкаНайдена Тогда
			
			Если РекурсивныйВызов Тогда
				ТекстСообщения = "Не найдена строка в документе " + Данные.ИНН + ", " + Данные.Период + ", " + Данные.Организация + 
					Данные.Документ + ", Счет: " + Данные.Счет + ", Кор. счет: " + Данные.КорСчет + ", "+ 
					СокрЛП(Данные.ВидОперации) + ", " + Данные.Группа;
				Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное
				);
				ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);
			Иначе
				ОтправитьОперацию(БазаОле, Данные, "5050505050", Затирать);	
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОтправитьОперацию(БазаОле, Данные, "5050505050", Затирать);
		Если РекурсивныйВызов Тогда
			ТекстСообщения = "Не найдена операция для организации " + Данные.Организация + ", ИНН: " + Данные.ИНН + ", группа: " + ?(Данные.Группа = "Перс", "Перс", ?(Данные.Группа = "П20", "П20", Данные.ИНН));
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);
			ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ОтправитьПоступлениеМатериалов(БазаОле, Данные)
	
	ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_ВПроцессе());
	
	Док = БазаОле.CreateObject("Документ");
	ДокПоступлениеМатериалов = БазаОле.CreateObject("Документ.ПоступлениеМатериалов");
	Док.UseJournal("Материалы");
	
	Если Док.ВыбратьПоЗначению(Данные.Период, КонецМесяца(Данные.Период), "ИНН", 
		?(Данные.Группа = "Перс", "Перс", ?(Данные.Группа = "П20", "П20", Данные.ИНН))) Тогда
		
		Пока Док.ПолучитьДокумент() Цикл
			Если ДокПоступлениеМатериалов.FindDocument(Док.ТекущийДокумент()) Тогда
				
				СтрокаНайдена = Ложь;
				//ДокПоступлениеМатериалов.ВыбратьСтроки();
				Если ДокПоступлениеМатериалов.GetLineByNum(1) Тогда
					СтрокаНайдена = Истина;
					ДокПоступлениеМатериалов.SetAttrib("Количество", Данные.СуммаОперации);
					ДокПоступлениеМатериалов.SetAttrib("Цена",1); 
					ДокПоступлениеМатериалов.SetAttrib("Сумма", Данные.СуммаОперации); 
					ДокПоступлениеМатериалов.SetAttrib("Всего", Данные.СуммаОперации);
					
					ЗаписатьДок(ДокПоступлениеМатериалов, Данные, Неопределено);
				КонецЕсли;
			Иначе
				ТекстСообщения = "Не найдена строка в документе " + Данные.ИНН + ", " + Данные.Период + ", " + Данные.Организация + 
					Данные.Документ + ", Счет: " + Данные.Счет + ", Кор. счет: " + Данные.КорСчет + ", "+ 
					СокрЛП(Данные.ВидОперации) + ", " + Данные.Группа;
				Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное
				);
				ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);				
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ СтрокаНайдена Тогда
			ТекстСообщения = "Не найдена строка в документе " + Данные.ИНН + ", " + Данные.Период + ", " + Данные.Организация + 
				Данные.Документ + ", Счет: " + Данные.Счет + ", Кор. счет: " + Данные.КорСчет + ", "+ 
				СокрЛП(Данные.ВидОперации) + ", " + Данные.Группа;
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное
			);
			ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОтправитьПоступлениеТоваров(БазаОле, Данные)
	
	ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_ВПроцессе());
	
	Док = БазаОле.CreateObject("Документ");
	ДокПоступлениеТоваров = БазаОле.CreateObject("Документ.ПоступлениеТоваров");
	Док.UseJournal("Товары");
	
	Если Док.ВыбратьПоЗначению(Данные.Период, КонецМесяца(Данные.Период), "ИНН", 
		?(Данные.Группа = "Перс", "Перс", ?(Данные.Группа = "П20", "П20", Данные.ИНН))) Тогда
		
		Пока Док.ПолучитьДокумент() Цикл
			Если ДокПоступлениеТоваров.FindDocument(Док.CurrentDocument()) Тогда
				
				СтрокаНайдена = Ложь;
				//ДокПоступлениеМатериалов.ВыбратьСтроки();
				Если ДокПоступлениеТоваров.GetLineByNum(1) Тогда
					СтрокаНайдена = Истина;
					ДокПоступлениеТоваров.SetAttrib("Количество", Данные.СуммаОперации);
					ДокПоступлениеТоваров.SetAttrib("Цена",1); 
					ДокПоступлениеТоваров.SetAttrib("Сумма", Данные.СуммаОперации); 
					ДокПоступлениеТоваров.SetAttrib("Всего", Данные.СуммаОперации);
					
					ЗаписатьДок(ДокПоступлениеТоваров, Данные, Неопределено);
				КонецЕсли;
			Иначе
				ТекстСообщения = "Не найдена строка в документе " + Данные.ИНН + ", " + Данные.Период + ", " + Данные.Организация + 
					Данные.Документ + ", Счет: " + Данные.Счет + ", Кор. счет: " + Данные.КорСчет + ", "+ 
					СокрЛП(Данные.ВидОперации) + ", " + Данные.Группа;
				Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное
				);
				ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);				
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ СтрокаНайдена Тогда
			ТекстСообщения = "Не найдена строка в документе " + Данные.ИНН + ", " + Данные.Период + ", " + Данные.Организация + 
				Данные.Документ + ", Счет: " + Данные.Счет + ", Кор. счет: " + Данные.КорСчет + ", "+ 
				СокрЛП(Данные.ВидОперации) + ", " + Данные.Группа;
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное
			);
			ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ТекстСообщения);
		КонецЕсли;		
		
	КонецЕсли;	
	
КонецПроцедуры		

Процедура ЗаписатьДок(Док, Данные, ДопПараметры)
	
	Попытка
		Док.Записать();
		Док.Провести();
		Сообщить("Записан документ "+ Док.НомерДок + ", от "+ Док.ДатаДок + ", номер строки: " + Док.НомерСтроки);
		ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Успешно(),, 
			"Записан документ "+ Док.НомерДок + ", от "+ Док.ДатаДок + ", номер строки: " + Док.НомерСтроки,
			ДопПараметры
		);
	Исключение
		Сообщить(ОписаниеОшибки());
		ЗатратыСервер.УстановитьСтатус(Данные, ЗатратыКлиентСервер.СтатусОтправки_Ошибка(), ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры	// ЗаписатьДок

Функция СтруктураСтрокиВыписки(ДокСтрока)
	
	ст = Новый Структура;
	ст.Вставить("НомерСтроки", ДокСтрока.НомерСтроки);
	ст.Вставить("КоличествоСтрок", ДокСтрока.КоличествоСтрок());
	Попытка
		ст.Вставить("ВидДвижения", СокрЛП(ДокСтрока.ВидДвижения.Наименование));
	Исключение
		ст.Вставить("ВидДвижения","");
	КонецПопытки;
	Попытка
		ст.Вставить("КоррСчет", ДокСтрока.КоррСчет.Код);
	Исключение
		ст.Вставить("КоррСчет","");
	КонецПопытки;		
	Попытка
		ст.Вставить("Субконто1", СокрЛП(ДокСтрока.Субконто1.Наименование));
	Исключение
		ст.Вставить("Субконто1","");
	КонецПопытки;
	Попытка
		ст.Вставить("Субконто2", СокрЛП(ДокСтрока.Субконто2.Наименование));
	Исключение
		ст.Вставить("Субконто2","");
	КонецПопытки;
	ст.Вставить("НазначениеПлатежа", СокрЛП(ДокСтрока.НазначениеПлатежа));
	
	Возврат ст;
	
КонецФункции

Функция СтруктураСтрокиОперации(ДокСтрока)
	
	ст = Новый Структура;
	
	Попытка
		ст.Вставить("СодержаниеПроводки", СокрЛП(ДокСтрока.СодержаниеПроводки));
	Исключение
		ст.Вставить("СодержаниеПроводки","");
	КонецПопытки;
	
	Попытка
		ст.Вставить("СчДт", ДокСтрока.Дебет.Счет.Код);
	Исключение
		ст.Вставить("СчДт","");
	КонецПопытки;		
	Попытка
		ст.Вставить("СубконтоДт1", СокрЛП(ДокСтрока.Дебет.Субконто(1).Наименование));
	Исключение
		ст.Вставить("СубконтоДт1","");
	КонецПопытки;
	Попытка
		ст.Вставить("СубконтоДт2", СокрЛП(ДокСтрока.Дебет.Субконто(2).Наименование));
	Исключение
		ст.Вставить("СубконтоДт2","");
	КонецПопытки;
	
	Попытка
		ст.Вставить("СчКт", ДокСтрока.Кредит.Счет.Код);
	Исключение
		ст.Вставить("СчКт","");
	КонецПопытки;		
	Попытка
		ст.Вставить("СубконтоКт1", СокрЛП(ДокСтрока.Кредит.Субконто(1).Наименование));
	Исключение
		ст.Вставить("СубконтоКт1","");
	КонецПопытки;
	Попытка
		ст.Вставить("СубконтоКт2", СокрЛП(ДокСтрока.Кредит.Субконто(2).Наименование));
	Исключение
		ст.Вставить("СубконтоКт2","");
	КонецПопытки;
	
	Попытка
		ст.Вставить("Сумма", ДокСтрока.Сумма);
	Исключение
		ст.Вставить("Сумма", 0);
	КонецПопытки;	
	
	Возврат ст;	
	
КонецФункции

#КонецОбласти