#Область ПрограммныйИнтерфейс
Функция ПолучитьСчет7(СчетИмя) Экспорт
	
	СчетИмя = ?(СтрНайти(СчетИмя, "П19")>0,"П20",  СчетИмя);
	
	Возврат Справочники.Счета7.СоздатьСчет7(СчетИмя);
КонецФункции

Процедура ЗаполнитьОстаткиИз8() Экспорт
	
	ПолучитьИЗаполнитьОстатки();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьИЗаполнитьОстатки()
	
	#Если Сервер И НЕ Сервер Тогда
		ДокОстатков = Документы.ЗагрузкаОстатков.СоздатьДокумент();
	#КонецЕсли
	
	// текущий период
	ДокОстатков = ПолучитьДокументОстатков(ТекущаяДатаСеанса());
	Если ЗначениеЗаполнено(ДокОстатков) Тогда
		ДокОб = ДокОстатков.ПолучитьОбъект();
		ДокОб.Остатки.Очистить();
		ДокОб.ЗаполнитьОстатками50и51Из8();
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	// предыдущий период
	ДокОстатков = ПолучитьДокументОстатков(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Если ЗначениеЗаполнено(ДокОстатков) Тогда
		ДокОб = ДокОстатков.ПолучитьОбъект();
		ДокОб.Остатки.Очистить();
		ДокОб.ЗаполнитьОстатками50и51Из8();
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
	
	
КонецПроцедуры

Функция ПолучитьДокументОстатков(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗагрузкаОстатков.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗагрузкаОстатков КАК ЗагрузкаОстатков
	               |ГДЕ
	               |	НЕ ЗагрузкаОстатков.ПометкаУдаления
				   |	И ЗагрузкаОстатков.Проведен
	               |	И НЕ ЗагрузкаОстатков.ОстаткиБазыМММ
	               |	И ЗагрузкаОстатков.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)";
	Запрос.УстановитьПараметр("Дата", Период);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЗагрузкаОстатков.Проведен", "");	
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Док = Документы.ЗагрузкаОстатков.СоздатьДокумент();
	Док.Дата = Период;
	Док.ОстаткиБазыМММ = Ложь;
	Попытка
		Док.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Док.Ссылка;	
	
КонецФункции		

#КонецОбласти


Процедура ЗагрузитьОстатки5051Из7(тч, Период) Экспорт
	
	БазаОле = мммСервер.ПодключитьсяКБазеМММКлиент();
	Если НЕ БазаОле = Неопределено Тогда
		
		ПолучитьОстатки51Из7(БазаОле, тч, Период);
		ПолучитьОстатки50Из7(БазаОле, тч, Период);
		ПолучитьОстатки60Из7(БазаОле, тч, Период);
		ПолучитьОстатки62Из7(БазаОле, тч, Период);
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПолучитьОстатки51Из7(БазаОле, тч, Период)
	
	Ит = БазаОле.CreateObject("БухгалтерскиеИтоги");
	Ит.ИспользоватьПланСчетов(БазаОле.EvalExpr("ОсновнойПланСчетов()"));
	Ит.ИспользоватьСубконто(БазаОле.EvalExpr("ВидыСубконто.БанковскиеСчета"), Неопределено, 1, 0);
	Ит.ВключатьСубсчета(1, 0);
	Ит.ВыполнитьЗапрос(Формат(Период,"ДЛФ=Д"), Формат(Период,"ДЛФ=Д"), "51", Неопределено, Неопределено, 3,Неопределено, "S");
	Ит.ВыбратьСчета();
	Пока Ит.ПолучитьСчет() = 1 Цикл
		Ит.ВыбратьСубконто(БазаОле.EvalExpr("ВидыСубконто.БанковскиеСчета"));
		Пока Ит.ПолучитьСубконто(БазаОле.EvalExpr("ВидыСубконто.БанковскиеСчета")) = 1 Цикл
			НоваяСтрока = тч.Добавить();
			НоваяСтрока.Счет = Ит.Счет.Код;
			НоваяСтрока.Счет7 = мммОтчетОстаткиСервер.ПолучитьСчет7(СокрЛП(Ит.Субконто(БазаОле.EvalExpr("ВидыСубконто.БанковскиеСчета")).Наименование));
			НоваяСтрока.СуммаОстатка = Число(Ит.СКД()) - Число(Ит.СКК());
		КонецЦикла;
	КонецЦикла;	
		
КонецПроцедуры	

Процедура ПолучитьОстатки50Из7(БазаОле, тч, Период)
	
	Ит = БазаОле.CreateObject("БухгалтерскиеИтоги");
	Ит.ИспользоватьПланСчетов(БазаОле.EvalExpr("ОсновнойПланСчетов()"));
	Ит.ВключатьСубсчета(1, 0);
	Ит.ВыполнитьЗапрос(Формат(Период,"ДЛФ=Д"), Формат(Период,"ДЛФ=Д"), "50", Неопределено, Неопределено, 1,Неопределено, "S");
	Ит.ВыбратьСчета();
	Пока Ит.ПолучитьСчет() = 1 Цикл
		НоваяСтрока = тч.Добавить();
		НоваяСтрока.Счет = Ит.Счет.Код;
		НоваяСтрока.Счет7 = ПредопределенноеЗначение("Справочник.Счета7.ПустаяСсылка");
		НоваяСтрока.СуммаОстатка = Число(Ит.СКД()) - Число(Ит.СКК());		
	КонецЦикла;	
		
КонецПроцедуры	

Процедура ПолучитьОстатки62Из7(БазаОле, тч, Период)
	
	Ит = БазаОле.CreateObject("БухгалтерскиеИтоги");
	Ит.ИспользоватьПланСчетов(БазаОле.EvalExpr("ОсновнойПланСчетов()"));
	Ит.ВключатьСубсчета(1, 0);
	Ит.ВыполнитьЗапрос(Формат(Период,"ДЛФ=Д"), Формат(Период,"ДЛФ=Д"), "62", Неопределено, Неопределено, 1,Неопределено, "S");
	Ит.ВыбратьСчета();
	Пока Ит.ПолучитьСчет() = 1 Цикл
		НоваяСтрока = тч.Добавить();
		НоваяСтрока.Счет = Ит.Счет.Код;
		НоваяСтрока.Счет7 = ПредопределенноеЗначение("Справочник.Счета7.ПустаяСсылка");
		НоваяСтрока.СуммаОстатка = Число(Ит.СКД()) - Число(Ит.СКК());		
	КонецЦикла;	
		
КонецПроцедуры	

Процедура ПолучитьОстатки60Из7(БазаОле, тч, Период)
	
	Ит = БазаОле.CreateObject("БухгалтерскиеИтоги");
	Ит.ИспользоватьПланСчетов(БазаОле.EvalExpr("ОсновнойПланСчетов()"));
	Ит.ВключатьСубсчета(1, 0);
	Ит.ВыполнитьЗапрос(Формат(Период,"ДЛФ=Д"), Формат(Период,"ДЛФ=Д"), "60", Неопределено, Неопределено, 1,Неопределено, "S");
	Ит.ВыбратьСчета();
	Пока Ит.ПолучитьСчет() = 1 Цикл
		НоваяСтрока = тч.Добавить();
		НоваяСтрока.Счет = Ит.Счет.Код;
		НоваяСтрока.Счет7 = ПредопределенноеЗначение("Справочник.Счета7.ПустаяСсылка");
		НоваяСтрока.СуммаОстатка = Число(Ит.СКД()) - Число(Ит.СКК());		
	КонецЦикла;	
		
КонецПроцедуры	