
Функция СведенияОВнешнейОбработке() Экспорт
	
	СтруктураСведения = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	СтруктураСведения.Вставить("Вид"            , "ДополнительнаяОбработка");
	СтруктураСведения.Вставить("Версия"         , "1.0");
	СтруктураСведения.Вставить("БезопасныйРежим", Ложь);
	СтруктураСведения.Вставить("Наименование"   , Метаданные().Синоним + " v " + СтруктураСведения.Версия);
								 //Строка - представление для администратора (наименование элемента справочника).
                                 //Если не заполнено, то берется представление объекта метаданных внешней обработки. Необязательное свойство. 
	
	//СтруктураСведения.Вставить("Информация"     , ""); Строка - краткая информация о внешней обработке.
                               //В этом параметре для администратора рекомендуется дать описание ее возможностей.
                               //Если не заполнено, то берется комментарий объекта метаданных внешней обработки.
							   
	КомандаОткрытия = СтруктураСведения.Команды.Добавить();
	КомандаОткрытия.Идентификатор = "ОткрытьОбработку";
	КомандаОткрытия.Использование = "ОткрытиеФормы";           
	КомандаОткрытия.Представление = СтруктураСведения.Наименование; // Название обработки, как его увидит пользователь - когда откроет пунк меню дополниьтельные отчет/обработки
	
	Возврат СтруктураСведения;
	
КонецФункции
