Функция СтатусОтправки_Успешно() Экспорт
	
	Возврат 1;
	
КонецФункции

Функция СтатусОтправки_НеОтправлено() Экспорт
	
	Возврат 3;
	
КонецФункции

Функция СтатусОтправки_Ошибка() Экспорт
	
	Возврат 2;
	
КонецФункции

Функция СтатусОтправки_ВПроцессе() Экспорт
	
	Возврат 0;
	
КонецФункции

Функция СтруктураДанных(Данные) Экспорт
	
	ст = Новый Структура;
	ст.Вставить("ВидОперации", Данные.ВидОперации);
	ст.Вставить("Группа", Данные.Группа);
	ст.Вставить("Документ", Данные.Документ);
	ст.Вставить("ИНН", Данные.ИНН);
	ст.Вставить("КорСчет", Данные.КорСчет);
	ст.Вставить("Организация", Данные.Организация);
	ст.Вставить("Период", Данные.Период);
	ст.Вставить("СуммаОперации", Данные.СуммаОперации);
	ст.Вставить("Счет", Данные.Счет);
	
	Возврат ст;
	
КонецФункции	

Процедура ОрганизацияПриИзменении(Форма) Экспорт
	
	Если Форма.Организация.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.Очередь, "Организация", Форма.Организация, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, "Организация", Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, Новый УникальныйИдентификатор);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.Очередь, "Организация");
	КонецЕсли;	
	
КонецПроцедуры

